ezois_ka/oooezoiskaobmen/src/Documents/ДокументЭДОБЗК/ДокументЭДОБЗК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументЭДОБЗК</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДокумента</name>
    <type>
      <types>DefinedType.ОбъектСПечатнымиФормами</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОснованиеДокумента</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявкиКабинетСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДокумента</name>
    <type>
      <types>EnumRef.КатегорииДокументовЭДОБЗК</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>АПК:58 Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеДокумента</name>
    <type>
      <types>EnumRef.СодержимоеДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписанСотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДокументаСоответствуетТребованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяТаблица</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПодписания</name>
    <type>
      <types>EnumRef.ВариантыПодписанияДокументовЭДОБЗК</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматФайлаPDF_A_1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДОБЗК</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеПодписанты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/ДокументЭДОБЗК/Forms/РедакторТабличногоДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ = Параметры.Документ;
	Организация = Параметры.Организация;
	НаименованиеДокумента = Параметры.НаименованиеДокумента;
	Дата = Параметры.Дата;
	
	Если Документ.ВысотаТаблицы = 0 Тогда
		ВывестиМакетПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаНаВОпросОСохраненииИзменений", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Документ изменен. Закрытие формы без сохранения изменений приведет к их потере.
			|
			|Продолжить?'"), РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьИЗакрыть(Команда)
	
	Если Модифицированность Тогда
		Модифицированность = Ложь;
		Закрыть(Документ);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	ОчиститьБланкДокумента();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаОтветаНаВОпросОСохраненииИзменений(Результат, ДополнительныеПраметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьБланкДокумента()
	
	Документ.Очистить();
	Документ.Область(, 1, , 34).ШиринаКолонки = 3;
	Для НомерСтроки = 1 По 5 Цикл
		ОбластьСтроки = Документ.Область(НомерСтроки, 1, НомерСтроки, 34);
		ОбластьСтроки.Объединить();
		ОбластьСтроки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетПоУмолчанию()
	
	ЗначенияПараметров = Новый Структура;
	Если ЗначениеЗаполнено(НаименованиеДокумента) Тогда
		ЗначенияПараметров.Вставить("НаименованиеДокумента", НаименованиеДокумента);
	Иначе
		ЗначенияПараметров.Вставить("НаименованиеДокумента", НСтр("ru = '/Введите наименование документа/'"));
	КонецЕсли;
	
	ЗначенияПараметров.Вставить("Номер", "№ _______________");
	ЗначенияПараметров.Вставить("Дата", Формат(Дата, "ДЛФ=DD"));
	
	ПредставлениеДолжности = "";
	ПредставлениеРуководителя = "";
	Если ЗначениеЗаполнено(Организация) Тогда
		Сведения = Новый СписокЗначений;
		Сведения.Добавить("", "НаимЮЛПол");
		Сведения.Добавить("", "ИННЮЛ");
		Сведения.Добавить("", "НаимЮЛСокр");
		Сведения.Добавить("", "КППЮЛ");
		
		Сведения.Добавить("", "ОГРН");
		
		Сведения.Добавить("", "ТелОрганизации");
		Сведения.Добавить("", "ФаксОрганизации");
		
		ОргСведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			Организация, Дата, Сведения);
		
		ЗначенияПараметров.Вставить("ОрганизацияНаименованиеПолное", ОргСведения.НаимЮЛПол);
		ЗначенияПараметров.Вставить("ОрганизацияНаименованиеСокращенное", ОргСведения.НаимЮЛСокр);
		ЗначенияПараметров.Вставить("ОрганизацияИНН", ОргСведения.ИННЮЛ);
		ЗначенияПараметров.Вставить("ОрганизацияКПП", ОргСведения.КППЮЛ);
		ЗначенияПараметров.Вставить("ОрганизацияОГРН", ОргСведения.ОГРН);
		ЗначенияПараметров.Вставить("ОрганизацияТелефон", ОргСведения.ТелОрганизации);
		ЗначенияПараметров.Вставить("ОрганизацияФакс", ОргСведения.ФаксОрганизации);
		
		ОтветственныеЛица = ЗарплатаКадры.ОтветственныеЛицаОрганизации(Организация, "Руководитель,ДолжностьРуководителя", Дата);
		Если ЗначениеЗаполнено(ОтветственныеЛица.Руководитель) Тогда
			КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическогоЛица(Истина, ОтветственныеЛица.Руководитель, "ИОФамилия", Дата);
			Если ЗначениеЗаполнено(КадровыеДанные) Тогда
				ПредставлениеРуководителя = КадровыеДанные.ИОФамилия;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтветственныеЛица.ДолжностьРуководителя) Тогда
			РеквизитыДолжности = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ОтветственныеЛица.ДолжностьРуководителя, "Наименование, НаименованиеДляЗаписейОТрудовойДеятельности");
			ПредставлениеДолжности = РеквизитыДолжности.НаименованиеДляЗаписейОТрудовойДеятельности;
			Если Не ЗначениеЗаполнено(ПредставлениеДолжности) Тогда
				ПредставлениеДолжности = РеквизитыДолжности.Наименование;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЗначенияПараметров.Вставить("ОрганизацияНаименованиеПолное", НСтр("ru = '/Введите наименование организации/'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПредставлениеДолжности) Тогда
		ПредставлениеДолжности = НСтр("ru = 'Руководитель организации'");
	КонецЕсли;
	ЗначенияПараметров.Вставить("ДолжностьРуководителя", ПредставлениеДолжности);
	
	Если Не ЗначениеЗаполнено(ПредставлениеРуководителя) Тогда
		ПредставлениеРуководителя = НСтр("ru = '/Расшифровка подписи/'");
	КонецЕсли;
	ЗначенияПараметров.Вставить("РуководительРасшифровкаПодписи", ПредставлениеРуководителя);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДокументЭДОБЗК.ПФ_MXL_ПустойБланкДокументаЭДОБЗК");
	Макет.Параметры.Заполнить(ЗначенияПараметров);
	
	Документ.Вывести(Макет);
	
КонецПроцедуры

#КонецОбласти
